# Core Brewfile — installs on every machine.
# Shell, git, and CLI quality-of-life. Everything else lives in a module
# Brewfile (Brewfile.dev, Brewfile.web-local, ...) and is opt-in via setup.sh.
# Run via: brew bundle --file=Brewfile

# CLI tools
brew "coreutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "htop"
brew "jq"
brew "mise"          # one version manager for node/bun/python/ruby
brew "tmux"
brew "tree"
brew "wget"
brew "yq"

# Apps
cask "1password"
cask "claude"
cask "iterm2"
cask "raycast"

# Fonts
cask "font-inconsolata-nerd-font"
